---
kind: enumMember
id: F:Autodesk.Revit.DB.BRepBuilderState.InvalidState
enum: Autodesk.Revit.DB.BRepBuilderState
source: html/fc45f13e-33ba-47ca-3faf-558517899a90.htm
---
# Autodesk.Revit.DB.BRepBuilderState.InvalidState

BRepBuilder is in an invalid state. No further productive use is possible.